//package com.javaex.oop.concept;
//
//public class Method {
//
//	public static void main(String[] args) {
////		메소드란 클래스 안에 있는 함수를 뜻한다.
////		자바 프로그래밍 언어는 소스 파일에 메인 함수만 있더라도 반드시 클래스를 정의해야 한다는 특성이 있다.
////		그래서 다른 프로그래밍 언어에서 사용하는 함수(function)이라는 개념을 자바에서는 메소드(method)로 표현한다.
////		함수나 메서드나 위치의 차이이지 하고자 하는 역할은 다르지않으니 크게 의미를 두지 않아도 된다.
////		 
////		메소드 정의
////
////		접근 제어자/지정자 : 해당 메소드에 접근할 수 있는 범위를 명시
////		반환 타입(return type) : 메소드가 모든 작업을 마치고 반환하는 데이터의 타입을 명시
////		메소드명 : 메소드를 호출하기 위한 이름을 명시
////		매개변수 목록(parameters) : 메소드 호출 시에 전달되는 인수의 값을 저장할 변수들을 명시
////		구현부 : 메소드의 고유 기능을 수행하는 명령문의 집합. 중괄호 { } 안에 표현됨
//		
////		파라미터 / 아규먼트
////		메서드에는 메서드에 입력값을 설정해주는 변수 목록이 있는데, 메서드와 함수를 구분해서 말하듯이, 매개변수(parameter)와 인수(arguments)는 혼용해서 사용되는 헷갈리는 용어이므로 이번 시간에 잘 기억해 두자.
////
////		매개변수(파라미터) : 메소드를 정의할때 입력으로 전달된 값을 받는 변수를 의미
////		인수(아규먼트) : 메소드를 호출할 때 전달하는 입력값을 의미한다.
//		
//		public class Sample {
//		    public static int sum(int a, int b) {  // 메소드를 정의하는 입력값 a, b 는 매개변수(parameter)
//		        return a+b;
//		    }
//
//		    public static void main(String[] args) {
//		        sample.sum(3, 4);  // 메소드를 사용하는 입력값 3, 4는 인수(argument)
//		    }
//		}
//
//	}
//
//}
